print("**โปรแกรมคำนวน ผู้โดยสารที่ตกรถ และ จำนวนที่นั่งที่เหลือ**")
people = int(input("จำนวนคน:"))                          #คนต้องเป็นจำนวนเต็ม
bus = int(input("จำนวนรถบัสที่จะเดินทางไปเชียงใหม่:"))         #รถต้องเป็นจำนวนเต็ม

n = bus*20                                               #รถ1คันบรรจุได้20คน   n=จำนวนคนที่สามารถไปเชียงใหม่ได้(จำนวนที่นังรถบัสทั้งหมด)
if n-people >=0 :
    print("\n\nทุกคนสามารถไปเชียงใหม่ได้ และ เหลือที่นั่งอีก",n-people,"ที่นั่ง")
else :
    print("\n\nจำนวนคนที่ตกรถ:", people-n,"คน" )