a = input("ใส่ข้อความที่คุณต้องการ :")
c = "2468"  #เลขคี่
d = "13579" #เลขคู่
n = 0   #เลขหน้าข้อ
b = 0
z = 0   #จำนวนเลขคู่ทั้งหมด
y = 0   #จำนวนเลขคี่ทั้งหมด
for b in a :
    n += 1
    if b in c:          #เช้คb ว่าอยู่ในcไหม(เลขคู่)
        print(f"{n}. {b} เป็นตัวเลขคู่")
        z += 1
    elif b in d :       #เช้คb ว่าอยู่ในdไหม(เลขคี่)
        print(f"{n}. {b} เป็นตัวเลขแต่ไม่ใช่เลขคู่")
        y += 1
    else :
        print(f"{n}. {b} ไม่ใช่ตัวเลข")
print(f"""ข้อความ{a}ของคุณ
มีเลขคู่ทั้งหมด {z} ตัว
ไม่ใช่เลขคี่ทั้งหมด {n-y} ตัว
""")