a = int(input("ราคาสินค้าทั้งหมด (บาท):"))

if 500 <= a < 1000 :
    print("คุณได้รับส่วนลด5%\nส่วนลด",int(a*5/100),"บาท",\
        "\nราคาที่ต้องจ่าย",int(a-(a*5/100)),"บาท")
elif 1000 <= a < 2000 :
    print("คุณได้รับส่วนลด10%\nส่วนลด",int(a*10/100),"บาท",\
        "\nราคาที่ต้องจ่าย",int(a-(a*10/100)),"บาท")
elif 2000 <= a :
    print("คุณได้รับส่วนลด15%\nส่วนลด",int(a*15/100),"บาท",\
        "\nราคาที่ต้องจ่าย",int(a-(a*15/100)),"บาท")
elif 0 <= a < 500 :
    print("คุณไม่ได้รับส่วนลด\nส่วนลด 0 บาท","\nราคาที่ต้องจ่าย",a,"บาท")
else :
    print("Eror สินค้าราคาต่ำกว่า0บาท")
