#เปรียบเทียบ 

# ต้องเป็นชนิดข้อมูลเดียวกัน
# <
# >
# <=
# >=
# ==
# !=
# ans true fuse



# x,y = 10,5

# print("ค่าxมากกว่าy หรือไม่? :",x>y)
# print("ค่าxน้อยกว่ากว่าy หรือไม่? :",x<y)
# print("ค่าxมากกว่เท่ากับาy หรือไม่? :",x>=y)
# print("ค่าxน้อยกว่าเท่ากับ หรือไม่y? :",x<=y)
# print("ค่าxเท่ากับy หรือไม่? :", x==y)     #ตัวดำเนินการเปรียบเทียบใช้==
# print("ค่าxไม่เท่ากับy หรือไม่? :",x!=y)

# x,y,z = 8,7,9
# print("ค่าxมากกว่าy และ y มากกว่าz หรือไม่? :", x>y>z)
# print("ค่าxน้อยกว่าy และ y น้อยกว่าz หรือไม่? :", x<y<z)